
-- --------------------------------------------------------

--
-- Структура таблицы `order`
--

CREATE TABLE `order` (
  `id` int(6) NOT NULL,
  `docnumber` varchar(10) NOT NULL,
  `user` int(11) NOT NULL,
  `subtotal` decimal(6,2) NOT NULL DEFAULT '0.00',
  `discount` decimal(6,2) NOT NULL DEFAULT '0.00',
  `total` decimal(6,2) NOT NULL DEFAULT '0.00',
  `comment` text NOT NULL,
  `status` int(1) NOT NULL DEFAULT '0',
  `deleted` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=koi8u;

--
-- Дамп данных таблицы `order`
--

INSERT INTO `order` (`id`, `docnumber`, `user`, `subtotal`, `discount`, `total`, `comment`, `status`, `deleted`) VALUES
(1, 'FS-0000001', 1, '0.00', '0.00', '0.00', 'Группа 1, Заняття 10', 0, 1),
(2, 'FS-0000002', 3, '0.00', '0.00', '0.00', 'Якийсь ', 0, 1),
(3, 'FS-0000003', 9, '0.00', '0.00', '0.00', 'Зараз би поїсти піцци', 0, 1),
(4, 'FS-0000004', 2, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(5, 'FS-0000005', 5, '0.00', '0.00', '0.00', 'вітаємо', 0, 1),
(6, 'FS-0000006', 5, '0.00', '0.00', '0.00', 'вітаємо', 0, 1),
(7, 'FS-0000007', 13, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(8, 'FS-0000008', 1, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(9, 'FS-0000009', 13, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(10, 'FS-0000010', 1, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(11, 'FS-0000011', 17, '0.00', '0.00', '0.00', 'new vaccant order', 0, 1),
(12, 'FS-0000012', 24, '0.00', '0.00', '0.00', 'Well ', 0, 1),
(13, 'FS-0000013', 24, '0.00', '0.00', '0.00', 'Well ', 0, 1),
(14, 'FS-0000014', 30, '0.00', '0.00', '0.00', 'Замовлення aishyn (16:40) 08.12.2022', 0, 1),
(15, 'FS-0000015', 24, '0.00', '0.00', '0.00', 'Well ', 0, 1),
(16, 'FS-0000016', 9, '0.00', '0.00', '0.00', 'Хочу фільм', 0, 1),
(17, 'FS-0000017', 9, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(18, 'FS-0000018', 9, '0.00', '0.00', '0.00', 'Зараз розберемось', 0, 1),
(19, 'FS-0000019', 24, '0.00', '0.00', '0.00', 'Well', 0, 1),
(20, 'FS-0000020', 24, '0.00', '0.00', '0.00', 'Well', 0, 1),
(21, 'FS-0000021', 24, '0.00', '0.00', '0.00', 'Well', 0, 1),
(22, 'FS-0000022', 24, '0.00', '0.00', '0.00', 'Well', 0, 1),
(23, 'FS-0000023', 24, '0.00', '0.00', '0.00', 'Well', 0, 1),
(24, 'FS-0000024', 24, '0.00', '0.00', '0.00', 'Well', 0, 1),
(25, 'FS-0000025', 24, '0.00', '0.00', '0.00', 'Well done', 0, 1),
(26, 'FS-0000026', 24, '0.00', '0.00', '0.00', 'Well done', 0, 1),
(27, 'FS-0000027', 24, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(28, 'FS-0000028', 24, '0.00', '0.00', '0.00', 'Well done', 0, 1),
(29, 'FS-0000029', 24, '0.00', '0.00', '0.00', 'Well done', 0, 1),
(30, 'FS-0000030', 24, '0.00', '0.00', '0.00', 'Done', 0, 1),
(31, 'FS-0000031', 41, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(32, 'FS-0000032', 41, '0.00', '0.00', '0.00', 'bomba', 0, 1),
(33, 'FS-0000033', 41, '0.00', '0.00', '0.00', 'bomba', 0, 1),
(34, 'FS-0000034', 41, '0.00', '0.00', '0.00', 'bomba', 0, 1),
(35, 'FS-0000035', 46, '0.00', '0.00', '0.00', 'Замовлення створено успішно', 0, 1),
(36, 'FS-0000036', 47, '0.00', '0.00', '0.00', 'Post men', 0, 1),
(37, 'FS-0000037', 47, '0.00', '0.00', '0.00', 'Post men', 0, 1),
(38, 'FS-0000038', 47, '0.00', '0.00', '0.00', 'Post men', 0, 1),
(39, 'FS-0000039', 49, '0.00', '0.00', '0.00', 'good films', 0, 1),
(40, 'FS-0000040', 35, '0.00', '0.00', '0.00', 'Скачать фильм без СМС и регистрации', 0, 1),
(41, 'FS-0000041', 8, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(42, 'FS-0000042', 8, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(43, 'FS-0000043', 8, '0.00', '0.00', '0.00', 'ЯК ТАК?', 0, 1),
(44, 'FS-0000044', 8, '0.00', '0.00', '0.00', 'ЯК ТАК?', 0, 1),
(45, 'FS-0000045', 8, '0.00', '0.00', '0.00', 'ЯК ТАК?', 0, 1),
(46, 'FS-0000046', 52, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(47, 'FS-0000047', 8, '0.00', '0.00', '0.00', 'Якось так', 0, 1),
(48, 'FS-0000048', 8, '0.00', '0.00', '0.00', 'Я коментар', 0, 1),
(49, 'FS-0000049', 8, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 1),
(50, 'FS-0000050', 8, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 0),
(51, 'FS-0000051', 1, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 0),
(52, 'FS-0000052', 1, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 0),
(53, 'FS-0000053', 8, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 0),
(54, 'FS-0000054', 7, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 0),
(55, 'FS-0000055', 56, '0.00', '0.00', '0.00', 'Якийсь коментар', 0, 0);

--
-- Триггеры `order`
--
DELIMITER $$
CREATE TRIGGER `new_order_number` BEFORE INSERT ON `order` FOR EACH ROW BEGIN
  SELECT max(id) INTO @new_id FROM `order`;
  set @new_id = LPAD(COALESCE(@new_id, 0)+1,7,'0');
  SET NEW.docnumber = concat('FS-',@new_id);
END
$$
DELIMITER ;
